#coding:UTF-8
#__autor__='wyxces'


#----------字典dict的操作方法----------
# 取出所有的key值
# 取出所有的value值
# 取出所有的键值对，作为一个元组的元素
# 清空字典
# 删除key
# 合并两个字典


#----------列表list的操作方法----------
# 生成1个list（list()转换 和 推导式 两种方法？）
# 列表切片
# 倒数第n个元素
# 向列表追加数据n，无返回
# 求列表中的最大值，返回值
# 求列表中的最小值，返回值
# 求列表的长度，返回值
# 移除列表中指定的元素n，并返回移除元素的值
# 移除列表中指定的元素n，无返回
# 删除列表中下标为n的元素
# 反转,无返回
# 排序，无返回
# 返回排序结果，不改变原列表
# 返回元素n的下标值
# 在m位置的前面插入数据n
# 将列表list2连接到list1
# 返回数据n在列表中出现的次数
# 清空列表
# 检查元素是否出现在列表中
# 使用推导式+筛选 得到列表

#----------集合set的操作方法----------
# 清空集合
# 将n加到集合中
# 将集合中的n移除，如果不存在，则报keyerror错误
# 将集合中的n移除，不存在也不报错
# 检查元素是否在集合中

#----------file I/O 操作----------
# 打开一个文件的方法
# 读写文件的模式
#关闭文件
#读取指定字节数的文件
#按指定字符数，读取整行（包括\n）
#读取所有行，并返回列表
#移动光标位置
#返回当前文件 位置
#将字符写入文件
#将一个序列字符串列表写入文件
#用with方法 读写文件


#----------性能基础----------
# 7层模型-分别是什么，作用？
# 网站架构


#----------os----------
#  --权限检测
# 是否存在
# 是否可读
# 是否可写
# 是否可执行

# 修改工作目录
# 获取当前目录

#   --打开文件
# 以只读方式打开
# 只写
# 读写
# 打开时不阻塞
# 追加
# 创建并打开一个新文件
# 打开一个文件并截断它的长度为0
# 如果指定的文件存在，则返回错误

# 创建文件对象
# 关闭文件描述符
# 写入
# 设置描述符fd当前位置为 pos how

# 返回path指定文件夹包含的文件/文件夹名字的列表
# 创建目录
# 递归创建文件目录
# 删除空目录
# 递归删除目录
# 删除路径为path的文件
# 删除一个文件
# 读取n个字节
# 重命名
# 设定访问和修改的时间


#----------os.path----------
# 返回绝对路径
# 返回文件名
# 返回文件路径
# 路径存在则返回True,路径损坏返回False
# 返回最近文件修改时间
# 返回文件 path 创建时间
# 返回文件大小，如果文件不存在就返回错误
# 判断是否为绝对路径
# 判断路径是否为文件
# 判断路径是否为目录
# 判断路径是否为链接
# 把目录和文件名合成一个路径
# 返回path的真实路径
# 判断目录或文件是否相同
# 把路径分割成 dirname 和 basename，返回一个元组
# 分割路径，返回路径名和文件扩展名的元组
# 把路径分割为加载点与文件
# 遍历path，进入每个目录都调用visit函数，visit函数必须有3个参数(arg, dirname, names)，dirname表示当前目录的目录名，names代表当前目录下的所有文件名，args则为walk的第三个参数






