#coding:UTF-8
#__autor__='wyxces'


#----------字典dict的操作方法----------
# 取出所有的key值
# 取出所有的value值
# 取出所有的键值对，作为一个元组的元素
# 清空字典
# 删除key
# 合并两个字典


#----------列表list的操作方法----------
# 生成1个list（range 和 for 两种方法？）
# 列表切片
# 倒数第n个元素
# 向列表追加数据n，无返回
# 求列表中的最大值，返回值
# 求列表中的最小值，返回值
# 求列表的长度，返回值
# 移除列表中指定的元素n，并返回移除元素的值
# 移除列表中指定的元素n，无返回
# 删除列表中下标为n的元素
# 反转,无返回
# 排序，无返回
# 返回排序结果，不改变原列表
# 返回元素n的下标值
# 在m位置的前面插入数据n
# 将列表list2连接到list1
# 返回数据n在列表中出现的次数
# 清空列表
# 检查元素是否出现在列表中


#----------集合set的操作方法----------
# 清空集合
# 将n加到集合中
# 将集合中的n移除，如果不存在，则报keyerror错误
# 将集合中的n移除，不存在也不报错
# 检查元素是否在集合中